# ATFBaseExportOptions Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ATFBaseExportOptions Class
Members See Also
---
The base class for options used to export STL, XML and SAT format files (using ATF).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public class ATFBaseExportOptions : IDisposable
```

Visual Basic
---
```text
Public Class ATFBaseExportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ATFBaseExportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ATFBaseExportOptions Autodesk.Revit.DB..::..STLExportOptions
# See Also
ATFBaseExportOptions Members
Autodesk.Revit.DB Namespace